const _scheduleConfig = {
    "countdown_target": "2027-06-07",
    "time_source": "offset",
    "week_display": true,
    "subject_name": {
        "自@语": "语文自习",
        "自@数": "数学自习",
        "自@英": "英语自习",
        "自@物": "物理自习",
        "自@化": "化学自习",
        "自@生": "生物自习",
        "午练@数": "数学午练",
        "午练@物": "物理午练",
        "午练@化": "化学午练",
        "午练@生": "生物午练",
        "周练@数": "数学周练",
        "周练@物": "物理周练",
        "周练@化": "化学周练",
        "周练@生": "生物周练",
        "周练@语": "语文周练",
        "周练@英": "英语周练",
        "物": "物理",
        "英": "英语",
        "化": "化学",
        "语": "语文",
        "阳": "阳光体育",
        "数": "数学",
        "生": "生物",
        "班": "班会",
        "自": "自习",
        "体": "体育",
        "午练": "午练",
        "空堂": "空堂"
    },
    "timetable": {
        "workday": {
            "07:00-07:15": "到校",
            "07:15-07:20": "生物朗读",
            "07:20-07:50": "早自习",
            "07:50-08:30": 0,
            "08:30-08:40": "课间",
            "08:40-09:20": 1,
            "09:20-09:30": "课间",
            "09:30-10:10": 2,
            "10:10-10:40": "大课间",
            "10:40-11:20": 3,
            "11:20-11:25": "课间",
            "11:25-12:05": 4,
            "12:10-14:20": "午餐-午休",
            "14:20-14:40": 5,
            "14:40-15:20": 6,
            "15:20-15:30": "课间",
            "15:30-16:10": 7,
            "16:10-16:20": "课间",
            "16:20-17:00": 8,
            "17:00-17:10": "课间",
            "17:10-17:50": 9,
            "17:50-18:00": "课间",
            "18:00-18:40": 10,
            "18:40-19:20": "晚餐",
            "19:20-20:20": 11,
            "20:20-21:20": 12,
            "21:20-21:30": "课间",
            "21:30-22:30": "自习"
        },
        "saturday": {
            "07:30-08:29": 0,
            "08:30-08:39": "课间",
            "08:40-09:39": 1,
            "09:40-09:49": "课间",
            "09:50-10:49": 2,
            "10:50-10:59": "课间",
            "11:00-11:59": 3,
            "12:00-14:29": "午餐-午休",
            "14:30-15:59": 4,
            "16:00-16:09": "课间",
            "16:10-17:39": 5
        },
        "sunday": {
            "19:20-20:50": 0,
            "20:50-21:00": "自习",
            "21:00-22:20": 1,
            "22:20-23:10": "放学"
        },
        "TEST1": {
            "08:00-10:30": 0,
            "10:30-10:45": "课间",
            "10:45-12:00": 1,
            "14:30-15:45": 2,
            "15:45-15:55": "准备下一次考试",
            "15:55-17:10": 3,
            "17:10-17:30": "课间",
            "17:30-18:30": 4
        },
        "TEST2": {
            "7:40-9:40": 0,
            "9:40-10:00": "课间",
            "10:00-12:00": 1
        }
    },
    "divider": {
        "workday": [
            4,
            10
        ],
        "saturday": [
            3
        ],
        "sunday": []
    },
    "daily_class": [
        {
            "Chinese": "周日",
            "English": "SUN",
            "classList": [
                "自",
                "自"
            ],
            "timetable": "sunday"
        },
        {
            "Chinese": "周一",
            "English": "MON",
            "classList": [
                "化",
                "语",
                "语",
                "英",
                "英",
                "午练",
                "周练@数",
                "数",
                "班",
                "物",
                "生",
                "自@数",
                "自@数"
            ],
            "timetable": "workday"
        },
        {
            "Chinese": "周二",
            "English": "TUE",
            "classList": [
                "英",
                "生",
                "化",
                "体",
                "语",
                "午练",
                [
                    "周练@语",
                    "周练@英"
                ],
                [
                    "空堂",
                    "自@语",
                    "物"
                ],
                [
                    "数",
                    "英",
                    "周练@数",
                    "自@语"
                ],
                "物",
                "物",
                "自@英",
                "自@英"
            ],
            "timetable": "workday"
        },
        {
            "Chinese": "周三",
            "English": "WED",
            "classList": [
                "数",
                "数",
                "语",
                "物",
                "物",
                "午练",
                "周练@化",
                "生",
                "化",
                "英",
                "英",
                "自@物",
                "自@物"
            ],
            "timetable": "workday"
        },
        {
            "Chinese": "周四",
            "English": "THR",
            "classList": [
                "物",
                "生",
                "化",
                "化",
                "数",
                "午练",
                "周练@生",
                "自",
                "英",
                "语",
                "语",
                "自@语",
                "自@语"
            ],
            "timetable": "workday"
        },
        {
            "Chinese": "周五",
            "English": "FRI",
            "classList": [
                "数",
                "数",
                "物",
                "英",
                "体",
                "午练",
                "周练@物",
                "生",
                "生",
                "语",
                "化",
                "自@化",
                "自@生"
            ],
            "timetable": "workday"
        },
        {
            "Chinese": "周六",
            "English": "SAT",
            "classList": [
                "化",
                "语",
                "英",
                "生",
                "数",
                "物"
            ],
            "timetable": "saturday"
        },
        {
            "Chinese": "第一天",
            "English": "TEST1",
            "classList": [
                "语",
                "物",
                "化",
                "生",
                "自"
            ],
            "timetable": "TEST1"
        },
        {
            "Chinese": "第二天",
            "English": "TEST2",
            "classList": [
                "数",
                "英"
            ],
            "timetable": "TEST2"
        }
    ],
    "daily_schedule": [
        0,
        1,
        2,
        3,
        4,
        5,
        6
    ]
}

var scheduleConfig = JSON.parse(JSON.stringify(_scheduleConfig))
