const _scheduleConfig = {
    countdown_target: '2024-6-7',
    subject_name: {
        '自': '自习',
        '物': '物理',
        '英': '英语',
        '化': '化学',
        '语': '语文',
        '走': '走班',
        '体': '体育',
        '数': '数学',
    },
    timetable: {
        'workday': {
            '00:00-07:39': '早自习',
            '07:40-08:19': 0,
            '08:20-08:29': '课间',
            '08:30-09:09': 1,
            '09:10-09:19': '课间',
            '09:20-09:59': 2,
            '10:00-10:29': '大课间',
            '10:30-11:09': 3,
            '11:10-11:19': '课间',
            '11:20-11:59': 4,
            '12:00-12:59': '午休',
            '13:00-13:39': 5,
            '13:40-13:49': '课间',
            '13:50-14:29': 6,
            '14:30-14:59': '大课间',
            '15:00-15:39': 7,
            '15:40-15:49': '课间',
            '15:50-16:19': 8,
            '16:20-16:29': '课间',
            '16:30-17:29': 9,
            '17:30-18:29': '晚休',
            '18:30-19:29': 10,
            '19:30-19:39': '课间',
            '19:40-20:59': 11,
            '21:00-23:59': '放学',
        },
        'weekend': {
            '00:00-07:29': '早自习',
            '07:30-08:29': 0,
            '08:30-08:39': '课间',
            '08:40-09:39': 1,
            '09:40-09:49': '课间',
            '09:50-10:49': 2,
            '10:50-10:59': '课间',
            '11:00-11:59': 3,
            '12:00-13:09': '午休',
            '13:10-14:09': 4,
            '14:10-14:19': '课间',
            '14:20-15:19': 5,
            '15:20-15:29': '课间',
            '15:30-16:39': 6,
            '16:40-16:49': '课间',
            '16:50-17:49': 7,
            '17:50-23:59': '放学',
        }
    },
    daily_class: [
        {
            'Chinese': '日',
            'English': 'SUN',
            'classList': [['物', '化', '英'], ['语', '数', '走'], ['化', '英', '物'], ['数', '走', '语'], ['英', '物', '化'], ['走', '语', '数'], '自', ['走', '物', '化']],
            'timetable': 'weekend'
        },
        {
            'Chinese': '一',
            'English': 'MON',
            'classList': ['物', '英', '数', '语', '数', '自', '自', '化', '走', ['语', '语', '语'], ['语', '语', '语'], '自'],
            'timetable': 'workday'
        },
        {
            'Chinese': '二',
            'English': 'TUE',
            'classList': ['英', '数', '物', '化', '语', '自', '语', '走', '自', ['化', '英', '化'], ['化', '英', '化'], '自'],
            'timetable': 'workday'
        },
        {
            'Chinese': '三',
            'English': 'WED',
            'classList': ['数', '化', '英', '英', '走', '体', '语', '物', '自', ['物', '物', '英'], ['物', '物', '英'], '自'],
            'timetable': 'workday'
        },
        {
            'Chinese': '四',
            'English': 'THR',
            'classList': ['化', '物', '数', '走', '体', '自', '英', '语', '自', ['英', '走', '走'], ['英', '走', '走'], '自'],
            'timetable': 'workday'
        },
        {
            'Chinese': '五',
            'English': 'FRI',
            'classList': ['英', '数', '语', '走', '物', '自', '化', '自', '自', ['数', '数', '数'], ['数', '数', '数'], '自'],
            'timetable': 'workday'
        },
        {
            'Chinese': '六',
            'English': 'SAT',
            'classList': [['物', '化', '英'], ['语', '数', '走'], ['化', '英', '物'], ['数', '走', '语'], ['英', '物', '化'], ['走', '语', '数'], '自', ['走', '物', '化']],
            'timetable': 'weekend'
        }
    ]
}

var scheduleConfig = JSON.parse(JSON.stringify(_scheduleConfig))
